In [4]:
import pandas as pd

## pandas의 Data Structure

### 1. Series
* python의 List랑 거의 유사    
* list를 pandas의 Series로 바꿔줘야 pandas의 기능 지원을 받을 수 있다.

In [5]:
# python의 List
odd = [1,3,5,7,9]
odd

[1, 3, 5, 7, 9]

In [6]:
# pandas의 Series
pd_odd = pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
odd.mean()  # python에는 'mean' 기능이 없음

AttributeError: 'list' object has no attribute 'mean'

In [8]:
pd_odd.mean()  # 'mean' 기능을 쓰기 위해서는 list → Series로 바꿔줘야 함

5.0

### 2. DataFrame
* 행렬, 엑셀과 비슷
* DataFrame은 여러개의 Series로 이루어져 있다.
* Series는 vector 같고, DataFrame은 matrix 같다.

In [9]:
numbers = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
type(numbers)

pandas.core.frame.DataFrame

In [13]:
type(numbers[0])  # DataFrame 중 하나의 Column의 type은 Series

pandas.core.series.Series

In [15]:
type(numbers.loc[0])  # DataFrame 중 하나의 row의 type은 Series

pandas.core.series.Series

### 3. Data Type

In [16]:
# int == integer == 정수형
type(1)

int

In [17]:
# float == 실수형
type(1.0)

float

In [18]:
# str == string == 문자열
type('Hello World!')

str

In [21]:
odd = [1,3,5,7,9]  # list

odd = pd.Series(odd)  # Series

odd.dtypes  # Series 안의 데이터들의 데이터 타입은?

dtype('int64')

In [22]:
odd = [1,3,5,7.0,9]  # list → 하나만 float여도 float

odd = pd.Series(odd)  # Series

odd.dtypes  # Series 안의 데이터들의 데이터 타입은?

dtype('float64')

In [23]:
odd = [1,3,5,7.0,9, 'hello']  # list → 하나만 문자열이어도 문자열

odd = pd.Series(odd)  # Series

# O == object == str == string
odd.dtypes  # Series 안의 데이터들의 데이터 타입은?

dtype('O')

### 4. NaN (Not a Number)
* NaN 끼리는 비교할 수 없다.

In [32]:
import numpy as np

odd = [1,np.nan,5,7,9]  # np.nan == NaN == 값이 비어있다  == float

odd = pd.Series(odd)

odd.dtypes

dtype('float64')

In [33]:
odd.mean()

5.5

In [39]:
odd = [1,-1,5,7,9]  # 만약 NaN 값을 -1로 처리하면?

odd = pd.Series(odd)

odd.mean()  # 통계치가 달라지기 때문에 데이터 분석 측면에서는 NaN 처리가 중요하다!

4.2

In [40]:
1 == 1

True

In [41]:
np.nan == np.nan  # NaN의 특이한 특징, NaN 끼리는 비교할 수 없다.

False

* `isnull`    
: 비어 있으면 True, 비어있지 않으면 False
* `notnull`    
: 비어 있으면 False, 비어있지 않으면 True

In [42]:
value = np.nan
pd.isnull(value)

True

In [43]:
pd.notnull(value)

False

## Data Frame

### 1. 생성하기
* 이중 list로 DataFrame 생성    
: column을 명시할 수 없어서 column값을 별도로 세팅해줘야 함

In [50]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-03', 700, 'confirmed'],
    ['2017-01-10', 200, 'canceled'],
]

columns = ['date', 'price', 'state']  # 개수가 맞지 않으면 에러남

order = pd.DataFrame(order, columns = columns)

order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

* Dict를 만들고 그 안에 list 넣어서 DataFrame 생성    
: data와 columns이 같이 다녀서 편리

In [51]:
order = {
    'date' : ['2017-01-01', '2017-01-03', '2017-01-10'],
    'price' : [500, 700, 200],
    'state' : ['confiremd', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)

order

         date  price      state
0  2017-01-01    500  confiremd
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

* list를 만들고 그 안에 Dict을 넣어서 DataFrame 생성    
: 보통 데이터가 들어올 때 이 방식으로 많이 들어오기 때문에 많이 사용

In [55]:
order = [
    {'date':'2017-01-01', 'price':500, 'state':'confirmed'},
    {'date':'2017-01-03', 'price':700, 'state':'confirmed'},
    {'date':'2017-01-10', 'price':200, 'state':'canceled'},
]

order = pd.DataFrame(order)

order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

### 2. DataFrame의 세가지 구성요소    
* column
* index : row 한 줄을 상징하고 가져오는 기준(유니크한 column을 index로 쓸 수 있음)    `index_col`, `set_index`    
* value : 값

In [87]:
order_url = 'http://bit.ly/dsa-01-order'

order = pd.read_csv(order_url)

order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

In [88]:
# 유니크한 column을 index로 사용하기
# 1. index_col
# order = pd.read_csv(order_url, index_col = 'id')

# 2. set_index
order = pd.read_csv(order_url)
order = order.set_index('id')
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [89]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [90]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [91]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [92]:
type(order.index)  # Int64Index == Series

pandas.core.indexes.numeric.Int64Index

In [93]:
# columns 이름 바꾸기
order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result']
order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [94]:
order.head()  # 기본값은 5줄 출력

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed

In [95]:
order.tail()  # 기본값은 5줄 출력

    user_id  product_id        date  amount  address     result
id
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

### 3. 기본 연산

In [96]:
order['amount'].mean()

585.7142857142857

In [97]:
order['amount'].min()

200

In [98]:
order['amount'].max()

900

In [99]:
order['amount'].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

* `unique`     
: 데이터의 중복 제거

In [100]:
order['result'].unique()

array(['confirmed', 'canceled'], dtype=object)

* `value_counts()`    
: 각 종류별 데이터 개수    
: `normalize = True` 비율로 보여주는 옵션

In [101]:
order['result'].value_counts()

confirmed    4
canceled     3
Name: result, dtype: int64

In [102]:
order['result'].value_counts(normalize = True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

* `replace`    
: 데이터 값 변경    
: 원래 값에 다시 넣어줘야 원상복귀 안됨

In [103]:
order['result'].replace('confirmed', 'confirm').replace('canceled', 'cancel')

id
1    confirm
2    confirm
3    confirm
4     cancel
5    confirm
6     cancel
7     cancel
Name: result, dtype: object

In [104]:
order  # 다시 원래 데이터로 돌아옴

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [105]:
# 바뀐 값을 order['result']에 다시 넣어줘야 원상복귀가 안됨
order['result'] = order['result'].replace('confirmed', 'confirm').replace('canceled', 'cancel')
order

    user_id  product_id        date  amount  address   result
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

* `to_datetime`    
: pandas는 object(문자열)로 인식    
: 날짜인지 구별 못해서 날짜 컬럼인 걸 지정해주면 연도/월/일을 편하게 불러올 수 있다.    
: `dt.year[month,day]`

In [107]:
order['date'].dt.year

AttributeError: Can only use .dt accessor with datetimelike values

In [108]:
order['date'] = pd.to_datetime(order['date'])  # 날짜인거 인식
order['date'].dt.year

id
1    2017
2    2017
3    2017
4    2017
5    2017
6    2017
7    2017
Name: date, dtype: int64

## 행렬 검색하기

### 1. column 가져오기

In [110]:
# column 하나 가져오기
# [ ]
order['date']

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [111]:
# column 여러개 가져오기
# [ ] 안에 list를 넣기 때문에 [[ ]]
order[['user_id', 'date', 'amount']]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

In [112]:
columns = ['user_id', 'date', 'amount']  # python list
columns

['user_id', 'date', 'amount']

In [113]:
order[columns]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

In [115]:
type(order['date'])  # [ ] : Series

pandas.core.series.Series

In [116]:
type(order[['user_id', 'date', 'amount']])  # [[ ]] : DataFrame

pandas.core.frame.DataFrame

### 2. row 가져오기
* loc == locate

In [117]:
# row 하나 가져오기
order.loc[1]

user_id                         3
product_id                      9
date          2017-01-01 00:00:00
amount                        500
address                     Seoul
result                    confirm
Name: 1, dtype: object

In [118]:
# row 여러개 가져오기
order.loc[[1,3,7]]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
7         2           5 2017-01-10     200      NaN   cancel

In [119]:
order_ids = [1,3,7]
order.loc[order_ids]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
7         2           5 2017-01-10     200      NaN   cancel

In [120]:
type(order.loc[1])  # [ ] : Series

pandas.core.series.Series

In [121]:
type(order.loc[[1,3,7]])  # [[ ]] : DataFrame

pandas.core.frame.DataFrame

### 3. column, row 같이 가져오기

In [ ]:
order.